test/request-response-samples/UpdateProfile__correct_namespaces_other_prefixes/request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.bigdatacollect.or" xmlns:c="http://www.bigdatacollect.or/Common/Types" xmlns:n="http://www.bigdatacollect.or/Name/Types"><soap:Body><n:UpdateProfileRequest xmlns:n="http://www.bigdatacollect.or/Name/Types" xmlns="http://www.bigdatacollect.or/Name/Types"><n:Profile><n:IDs><common:UniqueID source="TESTSOURCE" xmlns:common="http://www.bigdatacollect.or/Common/Types">100</common:UniqueID></n:IDs><n:Phones><n:NamePhone primary="true"><n:IDs><common:UniqueID source="TEST" xmlns:common="http://www.bigdatacollect.or/Common/Types">1</common:UniqueID></n:IDs></n:NamePhone><n:NamePhone primary="false"><n:IDs><common:UniqueID source="TEST" xmlns:common="http://www.bigdatacollect.or/Common/Types">2</common:UniqueID></n:IDs></n:NamePhone></n:Phones></n:Profile></n:UpdateProfileRequest></soap:Body></soap:Envelope>